IDEA StatiCa Open Model
NonConformity.Guid Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Description of the nonconformity
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Guid Guid { get; set; }
Public Property Guid As Guid
	Get
	Set
public:
property Guid Guid {
	Guid get ();
	void set (Guid value);
}
Property Value
Type: Guid
See Also
Reference
NonConformity Class
IdeaRS.OpenModel.Message Namespace